In [2]:
import pandas as pd

# 학생 정보 데이터프레임 생성
student_df = pd.DataFrame(
    {
        "학생ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        "이름": [
            "민수",
            "지연",
            "현우",
            "수진",
            "영호",
            "민지",
            "지훈",
            "혜진",
            "정우",
            "서연",
        ],
        "나이": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
        "전공": [
            "물리학",
            "수학",
            "물리학",
            "컴퓨터공학",
            "수학",
            "화학",
            "생물학",
            "물리학",
            "화학",
            "수학",
        ],
    }
)

# 성적 정보 데이터프레임 생성
grade_df = pd.DataFrame(
    {
        "학생ID": [2, 3, 4, 5, 6, 7, 10, 11, 12, 13],
        "과목": [
            "미적분학",
            "물리학",
            "컴퓨터공학",
            "수학",
            "화학",
            "생물학",
            "수학",
            "영어",
            "역사",
            "철학",
        ],
        "성적": ["A", "B", "A", "F", "A", "C+", "D", "A+", "B+", "C"],
    }
)

1. 내부 조인(inner join)
    - 두 데이터프레임을 `학생ID`를 기준으로 Inner Join 한 결과를 출력하세요.
    
    ```bash
       학생ID  이름  나이     전공     과목  성적
    0     2  지연  21     수학   미적분학   A
    1     3  현우  22    물리학    물리학   B
    2     4  수진  23  컴퓨터공학  컴퓨터공학   A
    3     5  영호  24     수학     수학   F
    4     6  민지  25     화학     화학   A
    5     7  지훈  26    생물학    생물학  C+
    6    10  서연  29     수학     수학   D
    ```

In [5]:
pd.merge(student_df, grade_df, how="inner", on="학생ID")

   학생ID  이름  나이     전공     과목  성적
0     2  지연  21     수학   미적분학   A
1     3  현우  22    물리학    물리학   B
2     4  수진  23  컴퓨터공학  컴퓨터공학   A
3     5  영호  24     수학     수학   F
4     6  민지  25     화학     화학   A
5     7  지훈  26    생물학    생물학  C+
6    10  서연  29     수학     수학   D

2. 필터링
    - 두 데이터프레임을 `학생ID`를 기준으로 Inner Join 하세요.
    - 병합 결과에 대해서 과목이 수학인 결과만 출력하세요.
    
    ```bash
       학생ID  이름  나이  전공  과목 성적
    3     5  영호  24  수학  수학  F
    6    10  서연  29  수학  수학  D
    ```

In [7]:
inner = pd.merge(student_df, grade_df, how="inner", on="학생ID")
inner[inner["과목"] == "수학"]

   학생ID  이름  나이  전공  과목 성적
3     5  영호  24  수학  수학  F
6    10  서연  29  수학  수학  D

3. 범주형 자료형 변환과 정렬
    - 두 데이터프레임을 `학생ID`를 기준으로 Inner Join 하세요.
    - `성적` 데이터를 범주형 자료형으로 변환하세요.
    - 이 때, 순서형 자료형으로 변환하고 순서는 아래와 같습니다.
        - F, D, C, C+, B, B+, A, A+
    - 성적순으로 정렬한 결과를 출력하세요.
    
    ```bash
       학생ID  이름  나이     전공     과목  성적
    0     2  지연  21     수학   미적분학   A
    2     4  수진  23  컴퓨터공학  컴퓨터공학   A
    4     6  민지  25     화학     화학   A
    1     3  현우  22    물리학    물리학   B
    5     7  지훈  26    생물학    생물학  C+
    6    10  서연  29     수학     수학   D
    3     5  영호  24     수학     수학   F
    ```

In [16]:
category = ["F", "D", "C", "C+", "B", "B+", "A", "A+"]

inner["성적"] = pd.Categorical(
    values=inner["성적"],
    categories=category,
)

print(inner.sort_values(by="성적", ascending=False))

   학생ID  이름  나이     전공     과목  성적
0     2  지연  21     수학   미적분학   A
2     4  수진  23  컴퓨터공학  컴퓨터공학   A
4     6  민지  25     화학     화학   A
1     3  현우  22    물리학    물리학   B
5     7  지훈  26    생물학    생물학  C+
6    10  서연  29     수학     수학   D
3     5  영호  24     수학     수학   F

4. 왼쪽 조인(left join)
    - 두 데이터프레임을 `학생ID`를 기준으로 Left Join 한 결과를 출력하세요.
    
    ```bash
       학생ID  이름  나이     전공     과목   성적
    0     1  민수  20    물리학    NaN  NaN
    1     2  지연  21     수학   미적분학    A
    2     3  현우  22    물리학    물리학    B
    3     4  수진  23  컴퓨터공학  컴퓨터공학    A
    4     5  영호  24     수학     수학    F
    5     6  민지  25     화학     화학    A
    6     7  지훈  26    생물학    생물학   C+
    7     8  혜진  27    물리학    NaN  NaN
    8     9  정우  28     화학    NaN  NaN
    9    10  서연  29     수학     수학    D
    ```

In [18]:
left = pd.merge(student_df, grade_df, how="left", on="학생ID")
left

   학생ID  이름  나이     전공     과목   성적
0     1  민수  20    물리학    NaN  NaN
1     2  지연  21     수학   미적분학    A
2     3  현우  22    물리학    물리학    B
3     4  수진  23  컴퓨터공학  컴퓨터공학    A
4     5  영호  24     수학     수학    F
5     6  민지  25     화학     화학    A
6     7  지훈  26    생물학    생물학   C+
7     8  혜진  27    물리학    NaN  NaN
8     9  정우  28     화학    NaN  NaN
9    10  서연  29     수학     수학    D

5. 오른쪽 조인(right join)
    - 두 데이터프레임을 `학생ID`를 기준으로 Right Join 한 결과를 출력하세요.
    
    ```bash
       학생ID   이름    나이     전공     과목  성적
    0     2   지연  21.0     수학   미적분학   A
    1     3   현우  22.0    물리학    물리학   B
    2     4   수진  23.0  컴퓨터공학  컴퓨터공학   A
    3     5   영호  24.0     수학     수학   F
    4     6   민지  25.0     화학     화학   A
    5     7   지훈  26.0    생물학    생물학  C+
    6    10   서연  29.0     수학     수학   D
    7    11  NaN   NaN    NaN     영어  A+
    8    12  NaN   NaN    NaN     역사  B+
    9    13  NaN   NaN    NaN     철학   C
    ```

In [19]:
right = pd.merge(student_df, grade_df, how="right", on="학생ID")
right

   학생ID   이름    나이     전공     과목  성적
0     2   지연  21.0     수학   미적분학   A
1     3   현우  22.0    물리학    물리학   B
2     4   수진  23.0  컴퓨터공학  컴퓨터공학   A
3     5   영호  24.0     수학     수학   F
4     6   민지  25.0     화학     화학   A
5     7   지훈  26.0    생물학    생물학  C+
6    10   서연  29.0     수학     수학   D
7    11  NaN   NaN    NaN     영어  A+
8    12  NaN   NaN    NaN     역사  B+
9    13  NaN   NaN    NaN     철학   C